
var basketballTeam = [
	{league:'NBA', teams:['热火','骑士','活塞','凯尔特人','篮网','尼克斯','黄蜂','老鹰','公牛','76人','雄鹿','猛龙','魔术','步行者','奇才','马刺','湖人','快船','勇士','火箭','小牛','雷霆','开拓者','灰熊','爵士','太阳','掘金','森林狼','国王','鹈鹕','']},
	
	
	{league:'CBA', teams:['辽宁药都本溪','四川金强蓝鲸','新疆天山农商银行','山东高速','广东东莞银行','浙江广厦控股','北京首钢','浙江稠州银行','深圳马可波罗','上海玛吉斯','山西汾酒集团','江苏肯帝亚','青岛双星','福建泉州银行','北京控股翱龙','江苏同曦','吉林九台农商银行','天津融宝支付','八一双鹿电池','佛山农商银行']},
	
	
	{league:'韩男篮', teams:['全州KCC宙斯盾','蔚山现代太阳神','大邱猎户座','安阳KGC','首尔三星迅雷','原州东浦新世代','釜山KTF魔翼','昌原LG猎隼','首尔SK骑士','仁川黑色撞击者']}
]






