
var footballTeam = [
	{league:'中国超级联赛', teams:['广州恒大淘宝','上海上港','山东鲁能','北京国安','河南建业','上海绿地申花','石家庄永昌','长春亚泰','江苏国信舜天','重庆力帆','杭州大金绿城','广州富力','天津泰达权健','辽宁盘锦宏远','贵州茅台','上海申鑫']},
	{league:'英格兰超级联赛', teams:['莱切斯特城','阿森纳','曼切斯特城','曼彻斯特联','托特纳姆热刺','西汉姆联','利物浦','水晶宫','沃特福德','斯托克城','埃弗顿','南安普顿','西布罗姆维奇','切尔西','斯旺西','诺维奇','伯恩茅斯','纽卡斯尔联','桑德兰','阿斯顿维拉']},
	{league:'西班牙甲组联赛', teams:['巴塞罗那','马德里竞技','皇家马德里','塞尔塔','比利亚雷亚尔','拉科鲁尼亚','毕尔巴鄂竞技','巴伦西亚','埃尔瓦','塞维利亚','皇家贝蒂斯','西班牙人','皇家社会','希洪竞技','赫塔菲','巴列卡诺','马拉加','格拉纳达','拉斯帕尔马斯','莱万特']}
]






