<?php
	
	header("Content-type: text/html; charset=utf-8"); 
	




	$type=     $_POST['type'];
	$openId=   $_POST['openId'];
	$ShopData= $_POST['shopAttr'];



	switch ($type) {
		case 'ShopData':
			// 接收到的数据
			echo $openId.'--分割线--'.$ShopData;
			//echo $ShopData;
		break;
		case 'getData':
			echo '[
				{"id":"1","num":"5","title":"大山黑猪肉(五花肉)","price":"31","coverpic":"images/hzl_1.png","unit":"斤","imageList":[{"pic":"images/zr/1.jpg","pictitle":"黑猪肉肉质细腻且营养价值丰富。肌肉中的不饱和脂肪酸的含量为8.87%，特别是亚麻酸能保护肝脏，能提高人体免疫能力，同时还可以改善人体内SOD的活性，抑制MDA的生成，延缓机体衰老，细胞老化，含量显著高于其他猪种，对体有极高的营养价值及保健作用，如长期食用可延年益寿，并有着汤汁浓郁，绕齿留香。黑猪肌肉内的肉品鲜味主要特征氨基酸天冬氨酸、谷氨酸、甘氨酸、丙氨酸和肌苷酸的总含量明显高于洋猪，烹饪调出的汤汁浓郁，口留余香，对人体有着较大的辅助功能。","picid":"1"},{"pic":"images/zr/2.jpg","pictitle":"猪肉含有丰富的胶原蛋白质，脂肪含量也比肥肉低。它能防治皮肤干瘪起皱、增强皮肤弹性和韧性，对延缓衰老和促进儿童生长发育都具有特殊意义。为此，人们把猪蹄称为“美容食品” 和“类似于熊掌的美味佳肴”。生长在海拔600米的大山深处，全天候放养。主食为麦麸子，红薯藤，玉米等五谷作物。每头猪都通过食品局检验","picid":"2"}]},
				


				{"id":"2","num":"3","title":"大山纯良土鸡","price":"99","coverpic":"images/hzl_2.png","unit":"只","imageList":[{"pic":"images/ji/1.jpg","pictitle":"土鸡，家禽的一种。有别于笼养的肉鸡。其中以“山坡散养土鸡”为最好，公鸡冠大而红，性烈好斗，母鸡鸡冠极小。土鸡也叫草鸡、笨鸡，是指从古代家养驯化而成，从未经过任何杂交和优化配种，长期以自然觅食或结合粗饲喂养而成，具有较强的野外觅食和生存能力。具有耐粗饲、就巢性强和抗病力强等特性，肉质鲜美土鸡肉中含有丰富的蛋白质，微量元素和各种营养素，脂肪的含量比较低，对于我们人体的保健具有重要的价值","picid":"1"},{"pic":"images/ji/2.jpg","pictitle":"深山里面全天候散养，自由寻食，每天早晚各6点喂食一次。喂的是玉米等五谷杂粮以及青草。","picid":"2"},{"pic":"images/ji/3.jpg","pictitle":"看，鸡都飞上房子啦","picid":"3"}]},
				

				{"id":"3","num":"0","title":"农家放养山羊/羊肉/羊腿/羊排","price":"31","coverpic":"images/hzl_09.png","unit":"斤","imageList":[{"pic":"images/yang/1.jpg","pictitle":"羊肉，性温。羊肉有山羊肉、绵羊肉、野羊肉之分。古时称羊肉为羖肉、羝肉、羯肉。它既能御风寒，又可补身体，对一般风寒咳嗽、慢性气管炎、虚寒哮喘、肾亏阳痿、腹部冷痛、体虚怕冷腰膝酸软、面黄肌瘦、气血两亏、病后或产后身体虚亏等一切虚状均有治疗和补益效果，最适宜于冬季食用故被称为冬令补品，深受人们欢迎","picid":"1"},{"pic":"images/yang/2.jpg","pictitle":"山民深山放养，放在山上一天不用管，自己寻找食物。是冬季最佳补品。","picid":"2"}]},


				{"id":"4","num":"0","title":"农家放养牛肉","price":"39","coverpic":"images/hzl_10.png","unit":"斤","imageList":[{"pic":"images/niu/1.jpg","pictitle":"牛肉含有丰富的蛋白质，氨基酸。其组成比猪肉更接近人体需要，能提高机体抗病能力，对生长发育及手术后、病后调养 的人在补充失血和修复组织等方面特别适宜。中医食疗认为：寒冬食牛肉，有暖胃作用，为寒冬补益佳品。中医认为：牛肉有补中益气、滋养脾胃、强健筋骨、化痰息风、止渴止涎的功能。适用于中气下陷、气短体虚，筋骨酸软和贫血久病及面黄目眩之人食用。","picid":"1"},{"pic":"images/niu/2.jpg","pictitle":"深山农户养殖，采取自由放养！以山间青草为食。零食为蚕豆，黄豆等豆类。","picid":"2"}]},


				{"id":"5","num":"0","title":"大山黑猪肉排骨","price":"31.5","coverpic":"images/hzl_13.png","unit":"斤","imageList":[{"pic":"images/zr/1.jpg","pictitle":"黑猪肉肉质细腻且营养价值丰富。肌肉中的不饱和脂肪酸的含量为8.87%，特别是亚麻酸能保护肝脏，能提高人体免疫能力，同时还可以改善人体内SOD的活性，抑制MDA的生成，延缓机体衰老，细胞老化，含量显著高于其他猪种，对人体有极高的营养价值及保健作用，如长期食用可延年益寿，并有着汤汁浓郁，绕齿留香。黑猪肌肉内的肉品鲜味主要特征氨基酸天门冬氨酸、谷氨酸、甘氨酸、丙氨酸和肌苷酸的总含量明显高于洋猪，烹饪调出的汤汁浓郁，口留余香，对人体有着较大的辅助功能。","picid":"1"},{"pic":"images/zr/2.jpg","pictitle":"猪肉含有丰富的胶原蛋白质，脂肪含量也比肥肉低。它能防治皮肤干瘪起皱、增强皮肤弹性和韧性，对延缓衰老和促进儿童生长发育都具有特殊意义。为此，人们把猪蹄称为“美容食品” 和“类似于熊掌的美味佳肴”。生长在海拔600米的大山深处，全天候放养。主食为麦麸子，红薯藤，玉米等五谷作物。每头猪都通过食品局检验","picid":"2"}]},


				{"id":"6","num":"0","title":"纯良土鸡蛋30枚装","price":"45","coverpic":"images/hzl_14.png","unit":"盒","imageList":[{"pic":"images/jd/1.jpg","pictitle":"自由散养，吃五谷杂粮且白天自由觅食，鸡不受外力因素自然成长鸡放养过程中没有使用任何药物。由于鸡自由觅食虫子、青草，能吃到一些饲料中不含有的微量元素，所以，土鸡蛋好于饲料鸡蛋。","picid":"1"}]},


				{"id":"7","num":"0","title":"深水库草鱼","price":"12.8","coverpic":"images/hzl_17.png","unit":"斤","imageList":[{"pic":"images/cy/1.jpg","pictitle":"1.草鱼含有丰富的不饱和脂肪酸，对血液循环有利，是心血管病人的良好食物；2.草鱼含有丰富的硒元素，经常食用有抗衰老、养颜的功效，而且对肿瘤也有一定的防治作用；3.对于身体瘦弱、食欲不振的人来说，草鱼肉嫩而不腻，可以开胃、滋补。","picid":"1"},{"pic":"images/cy/2.jpg","pictitle":"深山水库天然放养，无人工喂食，自然生长。","picid":"2"}]},


				{"id":"8","num":"0","title":"深水库鲫鱼","price":"16.8","coverpic":"images/hzl_18.png","unit":"斤","imageList":[{"pic":"images/jy/1.jpg","pictitle":"鲫鱼味甘、性平，入脾、胃、大肠经，具有健脾、开胃、益气、利水、通乳、除湿之功效！营养价值位于淡水鱼类之首。","picid":"1"},{"pic":"images/jy/2.jpg","pictitle":"深山水库天然放养，无人工喂食，自然生长。","picid":"2"}]},

				{"id":"9","num":"0","title":"深水库鲤鱼","price":"13.6","coverpic":"images/hzl_03.png","unit":"斤","imageList":[{"pic":"images/ly/1.jpg","pictitle":"鲤鱼的蛋白质不但含量高，而且质量也很高，人体消化吸收率可达96%，并含有能供给人体必需的氨基酸、矿物质、维生素A和维生素D等人体所需元素。鲤鱼的脂肪多为不饱和脂肪酸，能最大限度的降低胆固醇，可以防治动脉硬化、冠心病，因此，多吃鱼可以健康长寿。","picid":"1"},{"pic":"images/ly/2.jpg","pictitle":"深山水库天然放养，无人工喂食，自然生长！鲤鱼还有个喜庆的习俗，就是过年每家必备《鲤鱼跃龙门》寓意升官发财之意。","picid":"2"}]},

				{"id":"10","num":"0","title":"农家自榨花生油","price":"102","coverpic":"images/hzl_22.png","unit":"9.5斤","imageList":[{"pic":"images/hsy/1.jpg","pictitle":"花生油淡黄透明，色泽清亮，气味芬芳，滋味可口，是一种比较容易消化的食用油。花生油含不饱和脂肪酸80%以上。花生油的脂肪酸构成是比较好的，易于人体消化吸收。据国外资料介绍，使用花生油，可使人体内胆固醇分解为胆汁酸并排出体外，从而降低血浆中胆固醇的含量。另外上，花生油中还含有磷脂、维生素E、胆碱等对人体有益的物质。经常食用花生油，可以防止皮肤皱裂老化，保护血管壁，防止血栓形成，有助于预防动脉硬化和冠心病。花生油中的胆碱，还可改善人脑的记忆力，延缓脑功能衰退。","picid":"1"},{"pic":"images/hsy/2.jpg","pictitle":"此香油所用芝麻是取自大山深处农户自家种植，运往农村压榨出来的。保存了天然的气息，独特的香味。","picid":"2"}]},

				{"id":"11","num":"0","title":"农家自榨菜籽油","price":"95","coverpic":"images/hzl_25.png","unit":"9.5斤","imageList":[{"pic":"images/czy/1.jpg","pictitle":"人体对菜籽油的吸收率很高，可达99%，因此它所含的亚油酸等不饱和脂肪酸和维生素E等营养成分能很好地被机体吸收，具有一定的软化血管、延缓衰老之的功效。由于榨油的原料是植物的种实，一般会含有一定的种子磷脂，对血管、神经、大脑的发育十分重要。菜籽油的胆固醇很少或几乎不含，所以怕胆固醇的人可以放心食用。","picid":"1"},{"pic":"images/czy/2.jpg","pictitle":"此菜籽油菜籽是取自大山深处农户自家种植，农村压榨出来的。保存了天然的气息，独特的香味。","picid":"2"}]},

				{"id":"12","num":"0","title":"农家自榨香油","price":"26","coverpic":"images/hzl_26.png","unit":"斤","imageList":[{"pic":"images/xy/1.jpg","pictitle":"香油，北方多称为芝麻油，麻油 ，是从芝麻中提炼出来的，具有特别香味，故称为香油。植物油类当中性价比最高口味最好的就是它了。因此市面上不法商贩制造假香油，这个需要注意哟。","picid":"1"},{"pic":"images/xy/2.jpg","pictitle":"此香油所用芝麻是取自大山深处农户自家种植，农村压榨出来的。保存了天然的气息，独特的香味。","picid":"2"}]},

				{"id":"13","num":"0","title":"大山黑猪猪蹄膀带猪脚","price":"33.6","coverpic":"images/hzl_1.png","unit":"斤","imageList":[{"pic":"images/ztb/1.jpg","pictitle":"黑猪肉肉质细腻且营养价值丰富。肌肉中的不饱和脂肪酸的含量为8.87%，特别是亚麻酸能保护肝脏，能提高人体免疫能力，同时还可以改善人体内SOD的活性，抑制MDA的生成，延缓机体衰老，细胞老化，含量显著高于其他猪种，对体有极高的营养价值及保健作用，如长期食用可延年益寿，并有着汤汁浓郁，绕齿留香。黑猪肌肉内的肉品鲜味主要特征氨基酸天冬氨酸、谷氨酸、甘氨酸、丙氨酸和肌苷酸的总含量明显高于洋猪，烹饪调出的汤汁浓郁，口留余香，对人体有着较大的辅助功能。","picid":"1"},{"pic":"images/ztb/2.jpg","pictitle":"猪肉含有丰富的胶原蛋白质，脂肪含量也比肥肉低。它能防治皮肤干瘪起皱、增强皮肤弹性和韧性，对延缓衰老和促进儿童生长发育都具有特殊意义。为此，人们把猪蹄称为“美容食品” 和“类似于熊掌的美味佳肴”。","picid":"2"},{"pic":"images/ztb/3.png","pictitle":"生长在海拔600米的大山深处，全天候放养。主食为麦麸子，红薯藤，玉米等五谷作物。每头猪都通过食品局检验","picid":"3"}]}
			]';

			break;
		default:
			# code...
			break;
	}


	$str='[{"id":"1","num":"5","title":"大山黑猪肉(五花肉)","price":"31","coverpic":"images/hzl_1.png","unit":"斤","imageList":[{"pic":"images/zr/1.jpg","pictitle":"黑猪肉肉质细腻且营养价值丰富。肌肉中的不饱和脂肪酸的含量为8.87%，特别是亚麻酸能保护肝脏，能提高人体免疫能力，同时还可以改善人体内SOD的活性，抑制MDA的生成，延缓机体衰老，细胞老化，含量显著高于其他猪种，对体有极高的营养价值及保健作用，如长期食用可延年益寿，并有着汤汁浓郁，绕齿留香。黑猪肌肉内的肉品鲜味主要特征氨基酸天冬氨酸、谷氨酸、甘氨酸、丙氨酸和肌苷酸的总含量明显高于洋猪，烹饪调出的汤汁浓郁，口留余香，对人体有着较大的辅助功能。","picid":"1"},{"pic":"images/zr/2.jpg","pictitle":"猪肉含有丰富的胶原蛋白质，脂肪含量也比肥肉低。它能防治皮肤干瘪起皱、增强皮肤弹性和韧性，对延缓衰老和促进儿童生长发育都具有特殊意义。为此，人们把猪蹄称为“美容食品” 和“类似于熊掌的美味佳肴”。生长在海拔600米的大山深处，全天候放养。主食为麦麸子，红薯藤，玉米等五谷作物。每头猪都通过食品局检验","picid":"2"}],"$$hashKey":"object:3"},{"id":"2","num":"3","title":"大山纯良土鸡","price":"99","coverpic":"images/hzl_2.png","unit":"只","imageList":[{"pic":"images/ji/1.jpg","pictitle":"土鸡，家禽的一种。有别于笼养的肉鸡。其中以“山坡散养土鸡”为最好，公鸡冠大而红，性烈好斗，母鸡鸡冠极小。土鸡也叫草鸡、笨鸡，是指从古代家养驯化而成，从未经过任何杂交和优化配种，长期以自然觅食或结合粗饲喂养而成，具有较强的野外觅食和生存能力。具有耐粗饲、就巢性强和抗病力强等特性，肉质鲜美土鸡肉中含有丰富的蛋白质，微量元素和各种营养素，脂肪的含量比较低，对于我们人体的保健具有重要的价值","picid":"1"},{"pic":"images/ji/2.jpg","pictitle":"深山里面全天候散养，自由寻食，每天早晚各6点喂食一次。喂的是玉米等五谷杂粮以及青草。","picid":"2"},{"pic":"images/ji/3.jpg","pictitle":"看，鸡都飞上房子啦","picid":"3"}],"$$hashKey":"object:4"},{"id":"9","num":1,"title":"深水库鲤鱼","price":"13.6","coverpic":"images/hzl_03.png","unit":"斤","imageList":[{"pic":"images/ly/1.jpg","pictitle":"鲤鱼的蛋白质不但含量高，而且质量也很高，人体消化吸收率可达96%，并含有能供给人体必需的氨基酸、矿物质、维生素A和维生素D等人体所需元素。鲤鱼的脂肪多为不饱和脂肪酸，能最大限度的降低胆固醇，可以防治动脉硬化、冠心病，因此，多吃鱼可以健康长寿。","picid":"1"},{"pic":"images/ly/2.jpg","pictitle":"深山水库天然放养，无人工喂食，自然生长！鲤鱼还有个喜庆的习俗，就是过年每家必备《鲤鱼跃龙门》寓意升官发财之意。","picid":"2"}],"$$hashKey":"object:11"},{"id":"10","num":1,"title":"农家自榨花生油","price":"102","coverpic":"images/hzl_22.png","unit":"9.5斤","imageList":[{"pic":"images/hsy/1.jpg","pictitle":"花生油淡黄透明，色泽清亮，气味芬芳，滋味可口，是一种比较容易消化的食用油。花生油含不饱和脂肪酸80%以上。花生油的脂肪酸构成是比较好的，易于人体消化吸收。据国外资料介绍，使用花生油，可使人体内胆固醇分解为胆汁酸并排出体外，从而降低血浆中胆固醇的含量。另外上，花生油中还含有磷脂、维生素E、胆碱等对人体有益的物质。经常食用花生油，可以防止皮肤皱裂老化，保护血管壁，防止血栓形成，有助于预防动脉硬化和冠心病。花生油中的胆碱，还可改善人脑的记忆力，延缓脑功能衰退。","picid":"1"},{"pic":"images/hsy/2.jpg","pictitle":"此香油所用芝麻是取自大山深处农户自家种植，运往农村压榨出来的。保存了天然的气息，独特的香味。","picid":"2"}],"$$hashKey":"object:12"}]';

	//echo $str;
	//var_dump(json_decode($str))
?>